# 🏗️ Terraform Plan Results

📋 **Infrastructure changes planned:**

```diff
vargasjr-preview  Initializing the backend...
vargasjr-preview  Successfully configured the backend "s3"! Terraform will automatically
                  use this backend unless the backend configuration changes.
vargasjr-preview  Initializing provider plugins...
                  - Finding hashicorp/aws versions matching "6.0.0"...
vargasjr-preview  - Installing hashicorp/aws v6.0.0...
vargasjr-preview  - Installed hashicorp/aws v6.0.0 (signed by HashiCorp)

                  Terraform has created a lock file .terraform.lock.hcl to record the provider
                  selections it made above. Include this file in your version control repository
                  so that Terraform can guarantee to make the same selections by default when
                  you run "terraform init" in the future.
vargasjr-preview  Terraform has been successfully initialized!

                  You may now begin working with Terraform. Try running "terraform plan" to see
                  any changes that are required for your infrastructure. All Terraform commands
                  should now work.

                  If you ever set or change modules or backend configuration for Terraform,
                  rerun this command to reinitialize your working directory. If you forget, other
                  commands will detect it and remind you to do so if necessary.
vargasjr-preview  - Fetching hashicorp/aws 6.0.0 for linux_amd64...
vargasjr-preview  - Retrieved hashicorp/aws 6.0.0 for linux_amd64 (signed by HashiCorp)
                  - Obtained hashicorp/aws checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
vargasjr-preview  Success! Terraform has validated the lock file and found no need for changes.
vargasjr-preview  aws_ses_email_identity.EmailIdentity (EmailIdentity): Refreshing state... [id=hello@vargasjr.dev]
vargasjr-preview  aws_ses_domain_identity.DomainIdentity (DomainIdentity): Refreshing state... [id=vargasjr.dev]
vargasjr-preview  Terraform used the selected providers to generate the following execution
                  plan. Resource actions are indicated with the following symbols:
                    + create

                  Terraform will perform the following actions:
vargasjr-preview  # aws_iam_instance_profile.ImageBuilderInstanceProfile (ImageBuilderInstanceProfile) will be created
                    + resource "aws_iam_instance_profile" "ImageBuilderInstanceProfile" {
                        + arn         = (known after apply)
                        + create_date = (known after apply)
                        + id          = (known after apply)
                        + name        = "vargasjr-imagebuilder-instance-profile"
                        + name_prefix = (known after apply)
                        + path        = "/"
                        + role        = "vargasjr-imagebuilder-role"
                        + tags        = {
                            + "Project" = "VargasJR"
                            + "Type"    = "preview"
                          }
                        + tags_all    = {
                            + "Project" = "VargasJR"
                            + "Type"    = "preview"
                          }
                        + unique_id   = (known after apply)
                      }

                    # aws_iam_role.EmailLambdaRole (EmailLambdaRole) will be created
                    + resource "aws_iam_role" "EmailLambdaRole" {
                        + arn                   = (known after apply)
                        + assume_role_policy    = jsonencode(
                              {
                                + Statement = [
                                    + {
                                        + Action    = "sts:AssumeRole"
                                        + Effect    = "Allow"
                                        + Principal = {
                                            + Service = "lambda.amazonaws.com"
                                          }
                                      },
                                  ]
                                + Version   = "2012-10-17"
                              }
                          )
                        + create_date           = (known after apply)
                        + force_detach_policies = false
                        + id                    = (known after apply)
                        + managed_policy_arns   = (known after apply)
                        + max_session_duration  = 3600
                        + name                  = "vargas-jr-email-lambda-role"
                        + name_prefix           = (known after apply)
                        + path                  = "/"
                        + tags                  = {
                            + "Project" = "VargasJR"
                            + "Type"    = "preview"
                          }
                        + tags_all              = {
                            + "Project" = "VargasJR"
                            + "Type"    = "preview"
                          }
                        + unique_id             = (known after apply)
                      }

                    # aws_iam_role.ImageBuilderRole (ImageBuilderRole) will be created
                    + resource "aws_iam_role" "ImageBuilderRole" {
                        + arn                   = (known after apply)
                        + assume_role_policy    = jsonencode(
                              {
                                + Statement = [
                                    + {
                                        + Action    = "sts:AssumeRole"
                                        + Effect    = "Allow"
                                        + Principal = {
                                            + Service = "ec2.amazonaws.com"
                                          }
                                      },
                                  ]
                                + Version   = "2012-10-17"
                              }
                          )
                        + create_date           = (known after apply)
                        + force_detach_policies = false
                        + id                    = (known after apply)
                        + managed_policy_arns   = (known after apply)
                        + max_session_duration  = 3600
                        + name                  = "vargasjr-imagebuilder-role"
                        + name_prefix           = (known after apply)
                        + path                  = "/"
                        + tags                  = {
                            + "Project" = "VargasJR"
                            + "Type"    = "preview"
                          }
                        + tags_all              = {
                            + "Project" = "VargasJR"
                            + "Type"    = "preview"
                          }
                        + unique_id             = (known after apply)
                      }

                    # aws_iam_role_policy_attachment.EmailLambdaBasicExecution (EmailLambdaBasicExecution) will be created
                    + resource "aws_iam_role_policy_attachment" "EmailLambdaBasicExecution" {
                        + id         = (known after apply)
                        + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
                        + role       = "vargas-jr-email-lambda-role"
                      }

                    # aws_iam_role_policy_attachment.ImageBuilderEC2Policy (ImageBuilderEC2Policy) will be created
                    + resource "aws_iam_role_policy_attachment" "ImageBuilderEC2Policy" {
                        + id         = (known after apply)
                        + policy_arn = "arn:aws:iam::aws:policy/EC2InstanceProfileForImageBuilder"
                        + role       = "vargasjr-imagebuilder-role"
                      }

                    # aws_iam_role_policy_attachment.ImageBuilderSSMPolicy (ImageBuilderSSMPolicy) will be created
                    + resource "aws_iam_role_policy_attachment" "ImageBuilderSSMPolicy" {
                        + id         = (known after apply)
                        + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
                        + role       = "vargasjr-imagebuilder-role"
                      }

                    # aws_imagebuilder_component.NodeJSComponent (NodeJSComponent) will be created
                    + resource "aws_imagebuilder_component" "NodeJSComponent" {
                        + arn          = (known after apply)
                        + data         = <<-EOT
                              name: Install Node.js 20
                              description: Installs Node.js 20.x on Ubuntu
                              schemaVersion: 1.0

                              phases:
                                - name: build
                                  steps:
                                    - name: UpdatePackages
                                      action: ExecuteBash
                                      inputs:
                                        commands:
                                          - apt update
                                          - apt install -y unzip curl
                                    - name: InstallNodeJS
                                      action: ExecuteBash
                                      inputs:
                                        commands:
                                          - curl -fsSL https://deb.nodesource.com/setup_20.x | bash -
                                          - apt-get install -y nodejs
                                          - node --version
                                          - npm --version
                                    - name: InstallSSMAgent
                                      action: ExecuteBash
                                      inputs:
                                        commands:
                                          - systemctl enable snap.amazon-ssm-agent.amazon-ssm-agent.service
                                          - systemctl start snap.amazon-ssm-agent.amazon-ssm-agent.service
                          EOT
                        + date_created = (known after apply)
                        + encrypted    = (known after apply)
                        + id           = (known after apply)
                        + name         = "vargasjr-nodejs-component"
                        + owner        = (known after apply)
                        + platform     = "Linux"
                        + region       = "us-east-1"
                        + skip_destroy = false
                        + tags         = {
                            + "Project" = "VargasJR"
                            + "Type"    = "preview"
                          }
                        + tags_all     = {
                            + "Project" = "VargasJR"
                            + "Type"    = "preview"
                          }
                        + type         = (known after apply)
                        + version      = "1.0.0"
                      }

                    # aws_imagebuilder_distribution_configuration.VargasJRDistConfig (VargasJRDistConfig) will be created
                    + resource "aws_imagebuilder_distribution_configuration" "VargasJRDistConfig" {
                        + arn          = (known after apply)
                        + date_created = (known after apply)
                        + date_updated = (known after apply)
                        + id           = (known after apply)
                        + name         = "vargasjr-dist-config"
                        + region       = "us-east-1"
                        + tags         = {
                            + "Project" = "VargasJR"
                            + "Type"    = "preview"
                          }
                        + tags_all     = {
                            + "Project" = "VargasJR"
                            + "Type"    = "preview"
                          }

                        + distribution {
                            + license_configuration_arns = []
                            + region                     = "us-east-1"

                            + ami_distribution_configuration {
                                + description        = "VargasJR AMI with Node.js pre-installed"
                                + name               = "vargasjr-nodejs-{{ imagebuilder:buildDate }}"
                                + target_account_ids = []
                              }
                          }
                      }

                    # aws_imagebuilder_image_pipeline.VargasJRImagePipeline (VargasJRImagePipeline) will be created
                    + resource "aws_imagebuilder_image_pipeline" "VargasJRImagePipeline" {
                        + arn                              = (known after apply)
                        + date_created                     = (known after apply)
                        + date_last_run                    = (known after apply)
                        + date_next_run                    = (known after apply)
                        + date_updated                     = (known after apply)
                        + distribution_configuration_arn   = (known after apply)
                        + enhanced_image_metadata_enabled  = true
                        + id                               = (known after apply)
                        + image_recipe_arn                 = (known after apply)
                        + infrastructure_configuration_arn = (known after apply)
                        + name                             = "vargasjr-nodejs-pipeline"
                        + platform                         = (known after apply)
                        + region                           = "us-east-1"
                        + status                           = "ENABLED"
                        + tags                             = {
                            + "Project" = "VargasJR"
                            + "Type"    = "preview"
                          }
                        + tags_all                         = {
                            + "Project" = "VargasJR"
                            + "Type"    = "preview"
                          }
                      }

                    # aws_imagebuilder_image_recipe.VargasJRImageRecipe (VargasJRImageRecipe) will be created
                    + resource "aws_imagebuilder_image_recipe" "VargasJRImageRecipe" {
                        + arn              = (known after apply)
                        + date_created     = (known after apply)
                        + id               = (known after apply)
                        + name             = "vargasjr-nodejs-recipe"
                        + owner            = (known after apply)
                        + parent_image     = "ami-0e2c8caa4b6378d8c"
                        + platform         = (known after apply)
                        + region           = "us-east-1"
                        + tags             = {
                            + "Project" = "VargasJR"
                            + "Type"    = "preview"
                          }
                        + tags_all         = {
                            + "Project" = "VargasJR"
                            + "Type"    = "preview"
                          }
                        + user_data_base64 = (known after apply)
                        + version          = "1.0.0"

                        + component {
                            + component_arn = (known after apply)
                          }
                      }

                    # aws_imagebuilder_infrastructure_configuration.VargasJRInfraConfig (VargasJRInfraConfig) will be created
                    + resource "aws_imagebuilder_infrastructure_configuration" "VargasJRInfraConfig" {
                        + arn                           = (known after apply)
                        + date_created                  = (known after apply)
                        + date_updated                  = (known after apply)
                        + id                            = (known after apply)
                        + instance_profile_name         = "vargasjr-imagebuilder-instance-profile"
                        + instance_types                = [
                            + "t3.medium",
                          ]
                        + name                          = "vargasjr-infra-config"
                        + region                        = "us-east-1"
                        + tags                          = {
                            + "Project" = "VargasJR"
                            + "Type"    = "preview"
                          }
                        + tags_all                      = {
                            + "Project" = "VargasJR"
                            + "Type"    = "preview"
                          }
                        + terminate_instance_on_failure = false
                      }

                    # aws_lambda_function.EmailLambdaFunction (EmailLambdaFunction) will be created
                    + resource "aws_lambda_function" "EmailLambdaFunction" {
                        + architectures                  = (known after apply)
                        + arn                            = (known after apply)
                        + code_sha256                    = (known after apply)
                        + filename                       = "./lambda-email-processor.js"
                        + function_name                  = "vargas-jr-email-processor"
                        + handler                        = "index.handler"
                        + id                             = (known after apply)
                        + invoke_arn                     = (known after apply)
                        + last_modified                  = (known after apply)
                        + memory_size                    = 128
                        + package_type                   = "Zip"
                        + publish                        = false
                        + qualified_arn                  = (known after apply)
                        + qualified_invoke_arn           = (known after apply)
                        + region                         = "us-east-1"
                        + reserved_concurrent_executions = -1
                        + role                           = (known after apply)
                        + runtime                        = "nodejs18.x"
                        + signing_job_arn                = (known after apply)
                        + signing_profile_version_arn    = (known after apply)
                        + skip_destroy                   = false
                        + source_code_hash               = (known after apply)
                        + source_code_size               = (known after apply)
                        + tags                           = {
                            + "Project" = "VargasJR"
                            + "Type"    = "preview"
                          }
                        + tags_all                       = {
                            + "Project" = "VargasJR"
                            + "Type"    = "preview"
                          }
                        + timeout                        = 30
                        + version                        = (known after apply)

                        + environment {
                            + variables = {
                                + "SES_WEBHOOK_SECRET" = ""
                                + "WEBHOOK_URL"        = "https://undefined/api/ses/webhook"
                              }
                          }
                      }

                    # aws_lambda_permission.EmailLambdaSESPermission (EmailLambdaSESPermission) will be created
                    + resource "aws_lambda_permission" "EmailLambdaSESPermission" {
                        + action              = "lambda:InvokeFunction"
                        + function_name       = "vargas-jr-email-processor"
                        + id                  = (known after apply)
                        + principal           = "ses.amazonaws.com"
                        + region              = "us-east-1"
                        + statement_id        = "AllowSESInvoke"
                        + statement_id_prefix = (known after apply)
                      }

                    # aws_s3_bucket.InboxBucket (InboxBucket) will be created
                    + resource "aws_s3_bucket" "InboxBucket" {
                        + acceleration_status         = (known after apply)
                        + acl                         = (known after apply)
                        + arn                         = (known after apply)
                        + bucket                      = "vargas-jr-inbox"
                        + bucket_domain_name          = (known after apply)
                        + bucket_prefix               = (known after apply)
                        + bucket_region               = (known after apply)
                        + bucket_regional_domain_name = (known after apply)
                        + force_destroy               = false
                        + hosted_zone_id              = (known after apply)
                        + id                          = (known after apply)
                        + object_lock_enabled         = (known after apply)
                        + policy                      = (known after apply)
                        + region                      = "us-east-1"
                        + request_payer               = (known after apply)
                        + tags_all                    = (known after apply)
                        + website_domain              = (known after apply)
                        + website_endpoint            = (known after apply)
                      }

                    # aws_s3_bucket.MemoryBucket (MemoryBucket) will be created
                    + resource "aws_s3_bucket" "MemoryBucket" {
                        + acceleration_status         = (known after apply)
                        + acl                         = (known after apply)
                        + arn                         = (known after apply)
                        + bucket                      = "vargas-jr-memory"
                        + bucket_domain_name          = (known after apply)
                        + bucket_prefix               = (known after apply)
                        + bucket_region               = (known after apply)
                        + bucket_regional_domain_name = (known after apply)
                        + force_destroy               = false
                        + hosted_zone_id              = (known after apply)
                        + id                          = (known after apply)
                        + object_lock_enabled         = (known after apply)
                        + policy                      = (known after apply)
                        + region                      = "us-east-1"
                        + request_payer               = (known after apply)
                        + tags_all                    = (known after apply)
                        + website_domain              = (known after apply)
                        + website_endpoint            = (known after apply)
                      }

                    # aws_s3_bucket_versioning.InboxBucketVersioning (InboxBucketVersioning) will be created
                    + resource "aws_s3_bucket_versioning" "InboxBucketVersioning" {
                        + bucket = (known after apply)
                        + id     = (known after apply)
                        + region = "us-east-1"

                        + versioning_configuration {
                            + mfa_delete = (known after apply)
                            + status     = "Disabled"
                          }
                      }

                    # aws_s3_bucket_versioning.MemoryBucketVersioning (MemoryBucketVersioning) will be created
                    + resource "aws_s3_bucket_versioning" "MemoryBucketVersioning" {
                        + bucket = (known after apply)
                        + id     = (known after apply)
                        + region = "us-east-1"

                        + versioning_configuration {
                            + mfa_delete = (known after apply)
                            + status     = "Disabled"
                          }
                      }

                    # aws_security_group.SSHSecurityGroup (SSHSecurityGroup) will be created
                    + resource "aws_security_group" "SSHSecurityGroup" {
                        + arn                    = (known after apply)
                        + description            = "Security group for VargasJR agent SSH access"
                        + egress                 = (known after apply)
                        + id                     = (known after apply)
                        + ingress                = (known after apply)
                        + name                   = "vargas-jr-ssh-access"
                        + name_prefix            = (known after apply)
                        + owner_id               = (known after apply)
                        + region                 = "us-east-1"
                        + revoke_rules_on_delete = false
                        + tags_all               = (known after apply)
                        + vpc_id                 = (known after apply)
                      }

                    # aws_security_group_rule.AllEgressRule (AllEgressRule) will be created
                    + resource "aws_security_group_rule" "AllEgressRule" {
                        + cidr_blocks              = [
                            + "0.0.0.0/0",
                          ]
                        + from_port                = 0
                        + id                       = (known after apply)
                        + protocol                 = "-1"
                        + region                   = "us-east-1"
                        + security_group_id        = (known after apply)
                        + security_group_rule_id   = (known after apply)
                        + self                     = false
                        + source_security_group_id = (known after apply)
                        + to_port                  = 0
                        + type                     = "egress"
                      }

                    # aws_security_group_rule.SSHIngressRule (SSHIngressRule) will be created
                    + resource "aws_security_group_rule" "SSHIngressRule" {
                        + cidr_blocks              = [
                            + "0.0.0.0/0",
                          ]
                        + description              = "SSH access from anywhere"
                        + from_port                = 22
                        + id                       = (known after apply)
                        + protocol                 = "tcp"
                        + region                   = "us-east-1"
                        + security_group_id        = (known after apply)
                        + security_group_rule_id   = (known after apply)
                        + self                     = false
                        + source_security_group_id = (known after apply)
                        + to_port                  = 22
                        + type                     = "ingress"
                      }

                    # aws_ses_receipt_rule.EmailReceiptRule (EmailReceiptRule) will be created
                    + resource "aws_ses_receipt_rule" "EmailReceiptRule" {
                        + arn           = (known after apply)
                        + enabled       = true
                        + id            = (known after apply)
                        + name          = "process-incoming-email"
                        + recipients    = [
                            + "hello@vargasjr.dev",
                          ]
                        + region        = "us-east-1"
                        + rule_set_name = "vargas-jr-email-rules"
                        + scan_enabled  = false
                        + tls_policy    = (known after apply)

                        + lambda_action {
                            + function_arn    = (known after apply)
                            + invocation_type = "Event"
                            + position        = 1
                          }
                      }

                    # aws_ses_receipt_rule_set.EmailReceiptRuleSet (EmailReceiptRuleSet) will be created
                    + resource "aws_ses_receipt_rule_set" "EmailReceiptRuleSet" {
                        + arn           = (known after apply)
                        + id            = (known after apply)
                        + region        = "us-east-1"
                        + rule_set_name = "vargas-jr-email-rules"
                      }

                  Plan: 22 to add, 0 to change, 0 to destroy.

                  ─────────────────────────────────────────────────────────────────────────────

                  Saved the plan to: plan

                  To perform exactly these actions, run the following command to apply:
                      terraform apply "plan"


```

**Summary:** Plan: 22 to add, 0 to change, 0 to destroy.

---
*This plan was generated automatically by the Terraform Plan workflow.*
